doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
    bool GetBatteryLevel(int& level, bool& charging, bool& discharging) override {
        uint16_t voltage_mv = 0;
        int current_ma = 0;
        if (!power_monitor_ready_ || !power_monitor_.Read(voltage_mv, current_ma))
            return false;

        // Match M5Unified's voltage-to-level formula for the Tab5 2S battery pack.
        const int cell_mv = voltage_mv / 2;
        level = std::clamp((cell_mv - 3300) * 100 / (4150 - 3350), 0, 100);

        uint8_t input = 0;
        if (pi4ioe2_->ReadInput(input)) {
            charging = (input & (1U << 6)) != 0;  // P6 = CHG_STAT, matches M5Unified.
            discharging = !charging && current_ma < -10;
        } else {
            charging = current_ma > 10;
            discharging = current_ma < -10;
        }
        return true;
    }

    // BSP power control functions
#if CONFIG_HAN_DICTIONARY
    esp_err_t InitializeSdBus() {
        if (sd_bus_initialized_)
            return ESP_OK;
        // Official Tab5 SPI pins. Wi-Fi uses its separate SDIO bus; never reconfigure it.
        spi_bus_config_t bus{};
        bus.mosi_io_num = GPIO_NUM_44;
        bus.miso_io_num = GPIO_NUM_39;
        bus.sclk_io_num = GPIO_NUM_43;
        bus.quadwp_io_num = -1;
        bus.quadhd_io_num = -1;
        bus.max_transfer_sz = 8192;
        const auto err = spi_bus_initialize(SPI2_HOST, &bus, SPI_DMA_CH_AUTO);
        if (err == ESP_OK)
            sd_bus_initialized_ = true;
        return err;
    }

    esp_err_t InitializeRawContentCard() {
        if (sd_card_)
            return ESP_OK;
        auto err = InitializeSdBus();
        if (err != ESP_OK)
            return err;
        err = sdspi_host_init();
        if (err != ESP_OK)
            return err;

        sdspi_device_config_t slot = SDSPI_DEVICE_CONFIG_DEFAULT();
        slot.host_id = SPI2_HOST;
        slot.gpio_cs = GPIO_NUM_42;
        sdspi_dev_handle_t device = -1;
        err = sdspi_host_init_device(&slot, &device);
        if (err != ESP_OK)
            return err;

        auto card = static_cast<sdmmc_card_t*>(calloc(1, sizeof(sdmmc_card_t)));
        if (!card) {
            sdspi_host_remove_device(device);
            return ESP_ERR_NO_MEM;
        }
        sdmmc_host_t host = SDSPI_HOST_DEFAULT();
        host.slot = device;
        host.max_freq_khz = SDMMC_FREQ_DEFAULT;
        err = sdmmc_card_init(&host, card);
        if (err != ESP_OK) {
            sdspi_host_remove_device(device);
            free(card);
            return err;
        }
        sd_card_ = card;
        ESP_LOGI(TAG, "SD card ready for raw access: %llu MiB",
                 static_cast<unsigned long long>(card->csd.capacity) * card->csd.sector_size /
                     (1024 * 1024));
        return ESP_OK;
    }

    void InitializeContentCard() {
        auto err = InitializeSdBus();
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "SD SPI unavailable: %s", esp_err_to_name(err));
            return;
        }
        sdmmc_host_t host = SDSPI_HOST_DEFAULT();
        host.slot = SPI2_HOST;
        host.max_freq_khz = SDMMC_FREQ_DEFAULT;
        sdspi_device_config_t slot = SDSPI_DEVICE_CONFIG_DEFAULT();
        slot.host_id = SPI2_HOST;
        slot.gpio_cs = GPIO_NUM_42;
        esp_vfs_fat_sdmmc_mount_config_t mount{};
        mount.format_if_mount_failed = false;
        mount.max_files = 6;
        mount.allocation_unit_size = 16 * 1024;
        err = esp_vfs_fat_sdspi_mount("/sdcard", &host, &slot, &mount, &sd_card_);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "No usable SD card (%s); using embedded sample", esp_err_to_name(err));
            spi_bus_free(SPI2_HOST);
            sd_bus_initialized_ = false;
            sd_card_ = nullptr;
            return;
        }
        sd_card_mounted_ = true;
        DictionaryService::GetInstance().store().Initialize();
    }

    std::string StartUsbStorageMode() {
#if !CONFIG_TINYUSB_MSC_ENABLED
        return "当前固件未启用 USB 读卡器";
#else
        if (usb_storage_)
            return {};

        auto& store = DictionaryService::GetInstance().store();
        store.Detach();
        if (sd_card_mounted_) {
            const auto err = esp_vfs_fat_sdcard_unmount("/sdcard", sd_card_);
            if (err != ESP_OK) {
                store.Initialize();
                return std::string("无法卸载 SD 卡：") + esp_err_to_name(err);
            }
            sd_card_ = nullptr;  // esp_vfs_fat_sdcard_unmount releases the descriptor.
            sd_card_mounted_ = false;
        }

        auto err = InitializeRawContentCard();
        if (err != ESP_OK)
            return std::string("无法读取 microSD 卡：") + esp_err_to_name(err);

        static char mount_path[] = "/sdcard";
        tinyusb_msc_storage_config_t storage_config{};
        storage_config.medium.card = sd_card_;
        storage_config.fat_fs.base_path = mount_path;
        storage_config.fat_fs.config.format_if_mount_failed = false;
        storage_config.fat_fs.config.max_files = 6;
        storage_config.fat_fs.config.allocation_unit_size = 16 * 1024;
        storage_config.fat_fs.do_not_format = true;
        storage_config.mount_point = TINYUSB_MSC_STORAGE_MOUNT_USB;
        err = tinyusb_msc_new_storage_sdmmc(&storage_config, &usb_storage_);
        if (err != ESP_OK) {
            usb_storage_ = nullptr;
            return std::string("USB 存储初始化失败：") + esp_err_to_name(err);
        }

        // Tab5 routes the USB-C connector to FSLS PHY 0, while the default ESP32-P4
        // TinyUSB configuration uses the high-speed controller connected to USB-A.
        // Start OTG1.1 first on the unused PHY, then atomically hand the external
        // USB-C PHY from USB-Serial/JTAG to TinyUSB. COM logging intentionally stops
        // after the swap and returns on the next reboot.
        tinyusb_config_t usb_config = TINYUSB_CONFIG_FULL_SPEED(nullptr, nullptr);
        err = tinyusb_driver_install(&usb_config);
        if (err != ESP_OK) {
            tinyusb_msc_delete_storage(usb_storage_);
            usb_storage_ = nullptr;
            return std::string("USB 设备启动失败：") + esp_err_to_name(err);
        }
        tud_disconnect();
        vTaskDelay(pdMS_TO_TICKS(100));
        usb_wrap_ll_phy_select(&USB_WRAP, 0);
        vTaskDelay(pdMS_TO_TICKS(50));
        tud_connect();
        ESP_LOGI(TAG, "microSD is now exported as a USB mass-storage device");
        return {};
#endif
    }
#endif
    void SetChargeQcEn(bool en) {
        if (pi4ioe2_) {
            uint8_t value = pi4ioe2_->ReadOutSet();
            if (en) {
                clrbit(value, 5);  // P5 = CHG_QC_EN (低电平使能)
            } else {
                setbit(value, 5);
            }
            pi4ioe2_->WriteOutSet(value);
        }
    }

    void SetChargeEn(bool en) {
        if (pi4ioe2_) {
            uint8_t value = pi4ioe2_->ReadOutSet();
            if (en) {
                setbit(value, 7);  // P7 = CHG_EN
            } else {
                clrbit(value, 7);
            }
            pi4ioe2_->WriteOutSet(value);
        }
    }

    void SetUsb5vEn(bool en) {
        if (pi4ioe2_) {
            uint8_t value = pi4ioe2_->ReadOutSet();
            if (en) {
                setbit(value, 3);  // P3 = USB5V_EN
            } else {
                clrbit(value, 3);
            }
            pi4ioe2_->WriteOutSet(value);
        }
    }

    void SetExt5vEn(bool en) {
        if (pi4ioe1_) {
            uint8_t value = pi4ioe1_->ReadOutSet();
            if (en) {
                setbit(value, 2);  // P2 = EXT5V_EN
            } else {
                clrbit(value, 2);
            }
            pi4ioe1_->WriteOutSet(value);
        }
    }
};

DECLARE_BOARD(M5StackTab5Board);
